---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.HostPanelScheduleAsPanelParam
source: html/5949dea4-5ae9-d018-f372-9f9f7a45ad70.htm
---
# Autodesk.Revit.DB.ParameterTypeId.HostPanelScheduleAsPanelParam Property

"Categorize as"

## Syntax (C#)
```csharp
public static ForgeTypeId HostPanelScheduleAsPanelParam { get; }
```